<template>
	<!--start questions-->
	<main class="main" id="main">
		<section class="questions content">
			<div class="container">
				<h2 class="section-title questions__title">
					Вопросы и ответы
				</h2>
				<div class="questions__inner">
					<div class="questions__tabs">
						<a class="questions__tab tab"
						@click="switchTabWithQuestion ( 0 )"
						:class="{ active : questionsTab === 0}">
							<span>Вопросы</span> <span>о выписке</span>
						</a>
						<a class="questions__tab tab"
						@click="switchTabWithQuestion ( 1 )"
						:class="{ active : questionsTab === 1}">
							<span>Оформление</span> <span>заказа</span>
						</a>
						<a class="questions__tab tab"
						@click="switchTabWithQuestion ( 2 )"
						:class="{ active : questionsTab === 2}">
							<span>Работа</span> <span>сайта</span>
						</a>
					</div>
					<div class="questions__tab-container">
					
						<div class="questions__tab-content tab-content"
						:class="{ active : questionsTab === 0}">
							<div class="questions__item"
							:class="{ active : answer[0]}">
								<div class="questions__item-title"
								@click="showAdditionalInformation ( 0 )">
									Как быстро я получу выписку?
									<div class="questions__icon-plus"></div>
								</div>
								
								<div class="questions__item-content"
								v-show="answer[0]">
									<p>Сроки зависят от загруженности сайта и количества обрабатываемых заявок. Если
										выписка не получена, то это значит, что запрос не был обработан Росреестром.
										Максимальный срок обработки запроса составляет три дня (согласно п.9 ст. 62
										закона No 218-ФЗ). Если выписка не будет получена по окончание срока, то
										деньги вернутся.
									</p>
									<p>
										Проверьте почту, не забудьте про папку "Спам" и "Рассылки". Возможно,
										почтовый сервис ошибочно определил письмо в неподходящую категорию. Так как
										файлы в больших количествах отправляются ежедневно, вероятность не заметить
										письмо и не прочесть велика. С помощью нашего сервиса вы можете
										самостоятельно следить за заказом и степенью его готовности после обработки
										Росреестром. Чтобы получить выписку, выберите "Мои заказы" (кнопка находится
										в панели меню).
									</p>
								</div>
								
							</div>
							<div class="questions__item"
							:class="{ active : answer[1]}">
								<div class="questions__item-title"
								@click="showAdditionalInformation ( 1 )">
									Почему в полученной выписке нет сведений о собственнике?
									<div class="questions__icon-plus"></div>
								</div>
								
								<div class="questions__item-content"
								v-show="answer[1]">
									<div class="questions__link-block">
										<a href="images/questions/screen1.jpg" class="questions__img--center fancybox" data-fancybox>
											<img src="images/questions/screen1.jpg" alt="">
										</a>

									</div>
									<p class="questions__text questions__text--center questions__text--grey">
										(Если сведений о собственнике в ЕГРН нет, то в графе «Особые отметки»
										указывается <br> «Сведения, необходимы для заполнения раздела 2
										отсутствуют»)
									</p>
									<p>
										Вся информация, находящаяся в выписке, берется из актуальной на данный
										момент
										базы Росреестра. В системе есть данные только по сделкам, заключённым до
										наступления 1998. При этом информация доступна исключительно о
										приватизированных
										объектах, находящихся в распоряжении законных владельцев.
									</p>
									<p>
										Наиболее частые ситуации, которые способствуют отсутствию информации о
										правообладателях:
										1. Отсутствует регистрация прав владельца.
									</p>
									<p>
										В основном, препятствием служит то, что владелец не думал о необходимости
										регистрации своих прав на имущество в Росреестре. Рассмотрим следующую
										ситуацию.
										Человек получает от государства земельный участок, становится членом
										некоммерческого садового товарищества. У него есть документы, подтверждающие
										право на недвижимость (свидетельство или членская книжка НСТ). Человек
										наивно
										полагает, что собственность находится в его законном владении. Только вот в
										документах госреестра он не укажется как собственник, хотя имущество
										действительно будет находиться на официальном кадастровом учёте.
									</p>
									<p>
										2. Новые действия с объектом не предпринимались с 31 января 1998 года.
									</p>
									<p>
										Так как в базе находятся лишь зарегистрированные после окончания 1998 года
										данные, то вся нужная информация, касающаяся собственников, до 1998 года
										запрашивается в Бюро технической инвентаризации, Департаменте городского
										имущества или в Департаменте жилищной политики и жилищного фонда.
									</p>
									<p>
										3. Выписка на коммунальную квартиру.
									</p>
									<p>
										Несмотря на то, что каждому собственнику принадлежит та или иная часть
										квартиры,
										она, являясь объектом недвижимости, не сможет содержать записи о владельце.
										Поэтому производить заказ выписок следует для каждой комнаты отдельно.
									</p>
									<p>
										4. Недавно оформленные права на недвижимость.
									</p>
									<p>
										Чтобы база ЕГРН обновилась, требуется время, поэтому произведенные две-три
										недели назад сделки могут не отображаться. Это происходит из-за того, что
										местные офисы Росреестра сначала передают данные в Москву. Следовательно,
										данные
										и информация появляется в онлайн-базе ЕГРН немного позже.
									</p>
									<p>
										5. Наследство.
									</p>
									<p>
										Подразумевается, что в выписке правообладатели не указаны или указаны, но
										неверно. Произойти это может по многим причинам. Рассмотрим несколько из
										них.
										Во-первых, собственник мог законно приватизировать жилплощадь прежде, чем
										наступил 1998 год. Затем, должной регистрации прав не последовало. Спустя
										время
										квартира переходит кому-либо в качестве наследства. Новый владелец тоже не
										регистрирует собственность. Несмотря на то, что он имеет все основания на
										получение наследства, в выписке не укажут ни одного владельца.
										Во-вторых, в необходимом документе может присутствовать исключительно
										предыдущий
										владелец. Здесь он смог зарегистрировать имущество в Росреестре, но вот его
										наследник этого не сделал. В такой ситуации в нужной выписке отобразится
										только
										предыдущий владелец.
									</p>
									<p>
										6. По одному адресу существует не один номер кадастра.
									</p>
									<p>
										Несостыковка в базе реестра могла возникнуть, как во время разделения
										объекта,
										так и из-за сложного адреса, который был указан неправильно.
									</p>
									<p>
										7. Ошибка сайта или неточность номера кадастра.
									</p>
									<p>
										Иногда владелец оказывается невиновным в отсутствии верных и актуальных
										сведений
										в реестре Ошибки происходят из-за проведенных кадастровых работ или при
										передаче
										информации из БТИ. Даже в самом Росреестре возникают сбои. Информация,
										которая
										должна поступить в реестр недвижимости из этого портала, может оказаться
										неверной. При обнаружении несоответствий необходимо написать обращение в
										Росреестр или МФЦ. После обращения будут исправлены и технические, и
										кадастровые
										ошибки.
									</p>
								</div>
								
							</div>
							<div class="questions__item"
							:class="{ active : answer[2]}">
								<div class="questions__item-title"
								@click="showAdditionalInformation ( 2 )">
									Как убедиться в подлинности и наличии ЭЦП?
									<div class="questions__icon-plus"></div>
								</div>
								<div class="questions__item-content"
								v-show="answer[2]">
									<p class="questions__text--mb">
										Согласно нормативным актам проверка любых ЭЦП должна осуществляться в
										удостоверяющих центрах, прошедших аккредитацию. К ним относится сайт
										Госуслуг и некоторые другие.
									</p>
									<p>
										<b>Как осуществить проверку:</b>
									</p>
									<div class="questions__step">
										<p>
											1. С почты или сайта (раздел <b>«Мои заказы»</b> ) скачиваем архив, где
											находится выписка.
										</p>
										<a class="fancybox" href="images/questions/screen2.jpg" data-fancybox>
											<img src="images/questions/screen2.jpg" alt="">
										</a>
									</div>
									<div class="questions__step">
										<p>
											2. Распаковываем <b>zip-файл</b>.
										</p>
										<a class="fancybox" href="images/questions/screen3.jpg" data-fancybox>
											<img src="images/questions/screen3.jpg" alt="">
										</a>
									</div>
									<div class="questions__step">
										<p>
											3. Открываем Госуслуги здесь: <a href="#">https://www.gosuslugi.ru/eds</a>.
										</p>
										<a class="fancybox" href="images/questions/screen4.jpg" data-fancybox>

											<img src="images/questions/screen4.jpg" alt="">
										</a>
									</div>
									<div class="questions__step">
										<p>
											4. В распакованном архиве находим объект названием
											<b>«out_docs_*****************.zip»</b>, выбираем его и вставляем в поле
											<b>«Электронный документ, подлинность подписи которого нужно
												проверить»</b>.
										</p>
										<a class="fancybox" href="images/questions/screen5.jpg" data-fancybox>

											<img src="images/questions/screen5.jpg" alt="">
										</a>
									</div>
								</div>
							</div>
							<div class="questions__item"
							:class="{ active : answer[3]}">
								<div class="questions__item-title"
								@click="showAdditionalInformation ( 3 )">
									Почему в выписке нет печати и подписи?
									<div class="questions__icon-plus"></div>
								</div>
								<div class="questions__item-content"
								v-show="answer[3]">

									<p>
										Важно обратить внимание на различие электронных и бумажных справок и
										выписок, полученных из ЕГРН. Выписка, полученная электронно, имеет не
										обычную, а электронно-цифровую подпись Росреестра. Она располагается в
										обособленном ZIP-документе, имеет SIG формат. Такая ЭЦП — официальная
										подпись Росреестра. Правовая сила электронной и бумажной выписки
										равнозначна, поэтому ЭЦП успешно идентифицируется многими организациями,
										которым выписку необходима.
										выписок, полученных из ЕГРН. Выписка, полученная электронно, имеет не
										обычную, а электронно-цифровую подпись Росреестра. Она располагается в
										обособленном ZIP-документе, имеет SIG формат. Такая ЭЦП — официальная
										подпись Росреестра. Правовая сила электронной и бумажной выписки
										равнозначна, поэтому ЭЦП успешно идентифицируется многими организациями,
										которым выписку необходима.
									</p>
								</div>
							</div>
							<div class="questions__item"
							:class="{ active : answer[4]}">
								<div class="questions__item-title"
								@click="showAdditionalInformation ( 4 )">
									В чем отличия электронной выписки из ЕГРН от обычной бумажной?
									<div class="questions__icon-plus"></div>
								</div>
								<div class="questions__item-content"
								v-show="answer[4]">

									<p>
										Сейчас доступно 2 варианта получения необходимого документа — электронный и
										бумажный. Их правовая сила одинакова. Чтобы заказать бумажную справку,
										обращаемся в ближайший офис МФЦ/Росреестра, предварительно узнав приемные
										часы. Время готовности справок варьируется от двух до семи суток. Намного
										оперативнее выписка ЕГРН поступит к заказчику, если запросить ее онлайн.
										Уполномоченный сотрудник регистрационного органа поставит электронную
										подпись, которая и будет подтверждать достоверность документа. Подводя итог,
										получаем, что электронная выписка — это лучший вариант, ведь ее можно
										заказать без сложностей и получить намного быстрее, чем бумажный аналог.
									</p>
								</div>
							</div>
						</div>
						
						
						
						<div class="questions__tab-content tab-content"
						:class="{ active : questionsTab === 1}">
							<div class="questions__item"
							:class="{ active : answer[5]}">
								<div class="questions__item-title"
								@click="showAdditionalInformation ( 5 )">
									Сколько выписок может быть в одном заказе?
									<div class="questions__icon-plus"></div>
								</div>
								<div class="questions__item-content"
								v-show="answer[5]">
									<p>
										Заказывайте столько документов, сколько вам нужно. Их количество не
										ограничено.
									</p>

								</div>
							</div>
						</div>
						<div class="questions__tab-content tab-content"
						:class="{ active : questionsTab === 2}">
							<div class="questions__item"
							:class="{ active : answer[6]}">
								<div class="questions__item-title"
								@click="showAdditionalInformation ( 6 )">
									Сколько длится поиск нужного мне объекта?
									<div class="questions__icon-plus"></div>
								</div>
								<div class="questions__item-content"
								v-show="answer[6]">
									<p>
										Длительность процесса зависит от загруженности базы данных. Чаще всего,
										действие не занимает больше двух минут. При проведении технических работ
										следует повторять поиск через каждые 10-60 минут.
									</p>

								</div>
							</div>
							<div class="questions__item"
							:class="{ active : answer[7]}">
								<div class="questions__item-title"
								@click="showAdditionalInformation ( 7 )">
									Как найти нужный объект. Залог успешного поиска
									<div class="questions__icon-plus"></div>
								</div>
								<div class="questions__item-content"
								v-show="answer[7]">
									<p>
										Чтобы найти определенный объект как можно быстрее, необходимо узнать его
										кадастровый номер. Сделать это можно, заглянув в документы на объект
										недвижимости. Такой подход гарантирует точный результат.
									</p>

								</div>
							</div>
							<div class="questions__item"
							:class="{ active : answer[8]}">
								<div class="questions__item-title"
								@click="showAdditionalInformation ( 8 )">
									Поиск объекта по кадастровому номеру
									<div class="questions__icon-plus"></div>
								</div>
								<div class="questions__item-content"
								v-show="answer[8]">
									<p>
										Такой способ поиска наиболее удобный. Помните, что кадастровый номер имеет следующую структуру: (две цифры):(две цифры):(шесть или семь цифр):(любое кол-во цифр). Схематично это выглядит так: AA:AA:AAAAAAA:AAAA
									</p>
									<p>
										Важно: количество двоеточий строго определено (их ровно 3), в поле для ввода вносятся только двоеточия и цифры (никаких пробелов или посторонних символов).
									</p>

								</div>
							</div>
							<div class="questions__item"
							:class="{ active : answer[9]}">
								<div class="questions__item-title"
								@click="showAdditionalInformation ( 9 )">
									Как проверить статус заказа
									<div class="questions__icon-plus"></div>
								</div>
								<div class="questions__item-content"
								v-show="answer[9]">
									<p>
										Сразу же после оплаты заказ отправляется в работу. Готовность выписок можно отследить на странице <a href="#">«Мои заказы»</a>, также уведомление о готовности будет отправлено на Ваш e-mail.
									</p>
									<p>
										Внимание! Письмо с выпиской может попасть в папку «спам» или «рассылки».
									</p>

								</div>
							</div>
						</div>
					</div>

				</div>
			</div>

		</section>
	</main>

</template>


<script>
	export default {
		name: 'QuestionsContent',
		data () {
			return {
				questionsTab: 0,
				answer: {
					0 : false, 
					1 : false, 
					2 : false, 
					3 : false, 
					4 : false, 
					5 : false, 
					6 : false, 
					7 : false, 
					8 : false, 
					9 : false, 
					10 : false 
				}
				
			} 
		},
		methods: {
			switchTabWithQuestion ( index ) {
				this.questionsTab = index;
			}, 
			showAdditionalInformation ( index ) {
				let key = index.toString();
				this.answer[key] = !this.answer[key];
			}
		}
	}
</script>